In [1]:
import pandas as pd

In [2]:
import numpy as np
import os
import matplotlib.pyplot as plt 
%matplotlib inline

In [3]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [4]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [6]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

## filter the column which is object

In [8]:
titanic_train[['Name','Sex','Ticket', 'Cabin', 'Embarked']]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
151,"Pears, Mrs. Thomas (Edith Wearne)",female,113776,C2,S
152,"Meo, Mr. Alfonzo",male,A.5. 11206,NaN,S
153,"van Billiard, Mr. Austin Blyler",male,A/5. 851,NaN,S
154,"Olsen, Mr. Ole Martin",male,Fa 265302,NaN,S
155,"Williams, Mr. Charles Duane",male,PC 17597,NaN,C

In [9]:
titanic_train[['Name','Sex','Ticket', 'Cabin', 'Embarked']].describe()

                       Name   Sex   Ticket        Cabin Embarked
count                   156   156      156           31      155
unique                  156     2      145           28        3
top     Osen, Mr. Olaf Elon  male  CA 2144  C23 C25 C27        S
freq                      1   100        2            2      110

In [10]:
titanic_train.dtypes =='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [17]:
a  =titanic_train.dtypes[titanic_train.dtypes == 'object']
print(a)
print(type(a))

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object
<class 'pandas.core.series.Series'>

In [23]:
#tach index of the dataset 
a  =titanic_train.dtypes[titanic_train.dtypes == 'object'].index
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [15]:
type(a)

pandas.core.indexes.base.Index

In [20]:
titanic_train[a].describe()

                       Name   Sex   Ticket        Cabin Embarked
count                   156   156      156           31      155
unique                  156     2      145           28        3
top     Osen, Mr. Olaf Elon  male  CA 2144  C23 C25 C27        S
freq                      1   100        2            2      110

In [21]:
#task 
#fatch int64 type data content 
a  =titanic_train.dtypes[titanic_train.dtypes == 'int64']
print(a)
print(type(a))

PassengerId    int64
Survived       int64
Pclass         int64
SibSp          int64
Parch          int64
dtype: object
<class 'pandas.core.series.Series'>

In [22]:
a.describe()

count         5
unique        1
top       int64
freq          5
dtype: object

In [25]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# Selection

In [27]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [28]:
titanic_train['Name'][0]

'Braund, Mr. Owen Harris'

In [30]:
titanic_train['Name'][10:21]

10                      Sandstrom, Miss. Marguerite Rut
11                             Bonnell, Miss. Elizabeth
12                       Saundercock, Mr. William Henry
13                          Andersson, Mr. Anders Johan
14                 Vestrom, Miss. Hulda Amanda Adolfina
15                     Hewlett, Mrs. (Mary D Kingcome)
16                                 Rice, Master. Eugene
17                         Williams, Mr. Charles Eugene
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                              Masselmani, Mrs. Fatima
20                                 Fynney, Mr. Joseph J
Name: Name, dtype: object

In [32]:
titanic_train[['Name']][10:21]

                                                 Name
10                    Sandstrom, Miss. Marguerite Rut
11                           Bonnell, Miss. Elizabeth
12                     Saundercock, Mr. William Henry
13                        Andersson, Mr. Anders Johan
14               Vestrom, Miss. Hulda Amanda Adolfina
15                   Hewlett, Mrs. (Mary D Kingcome)
16                               Rice, Master. Eugene
17                       Williams, Mr. Charles Eugene
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                            Masselmani, Mrs. Fatima
20                               Fynney, Mr. Joseph J

In [31]:
titanic_train['Name'][10:21:2]

10                      Sandstrom, Miss. Marguerite Rut
12                       Saundercock, Mr. William Henry
14                 Vestrom, Miss. Hulda Amanda Adolfina
16                                 Rice, Master. Eugene
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
20                                 Fynney, Mr. Joseph J
Name: Name, dtype: object

In [33]:
titanic_train[['Name','Survived']][10:21:2]

                                                 Name  Survived
10                    Sandstrom, Miss. Marguerite Rut         1
12                     Saundercock, Mr. William Henry         0
14               Vestrom, Miss. Hulda Amanda Adolfina         0
16                               Rice, Master. Eugene         0
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...         0
20                               Fynney, Mr. Joseph J         0

In [26]:
sorted(titanic_train['Name'])[5:10:2]

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [34]:
titanic_train['Name'].describe()

count                     156
unique                    156
top       Osen, Mr. Olaf Elon
freq                        1
Name: Name, dtype: object

# 5min Task

In [35]:
data = pd.read_csv('ex1.csv')

In [37]:
data.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [39]:
data.describe()

         a     b     c     d
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [40]:
df = data.describe()

In [41]:
df

         a     b     c     d
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [42]:
df.to_csv('describe.csv')

In [43]:
df['a'][0::2]

count    3.0
std      4.0
25%      3.0
75%      7.0
Name: a, dtype: float64

In [44]:
sorted(df['a'][0::2])

[3.0, 3.0, 4.0, 7.0]

# Mapping

In [45]:
titanic_train['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [46]:
new_Pclass = pd.Categorical(titanic_train['Pclass'])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [48]:
titanic_train['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
151      C2
152     NaN
153     NaN
154     NaN
155     NaN
Name: Cabin, Length: 156, dtype: object

In [53]:
# i wqant to create a new col and store the first letter of all data
import numpy as np
char_cabiin = titanic_train['Cabin'].astype(str)
char_cabiin
result = [cabin[0] for cabin in char_cabiin]
titanic_train['cabin_1'] = result

In [55]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,n
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,n
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,n

# Nulll Values

In [56]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [58]:
titanic_train['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [59]:
titanic_train['Age'].isnull() == True

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [60]:
#return the indesex where null value resence 
np.where(titanic_train['Age'].isnull() == True)

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [61]:
titanic_train['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
151    66.6000
152     8.0500
153    14.5000
154     7.3125
155    61.3792
Name: Fare, Length: 156, dtype: float64

In [62]:
titanic_train['Fare'].max()

263.0

In [63]:
max(titanic_train['Fare'])

263.0

In [69]:
# if i want to index value 
row_index = np.where(titanic_train['Fare']==max(titanic_train['Fare']))
row_index

(array([27, 88], dtype=int64),)

 select a row 
loc\n
iloc\n
ix

In [70]:
titanic_train.iloc[row_index]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C23 C25 C27,S,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C23 C25 C27,S,C

In [71]:
titanic_train.iloc[row_index][['Name', "Age"]]

                              Name   Age
27  Fortune, Mr. Charles Alexander  19.0
88      Fortune, Miss. Mabel Helen  23.0

In [72]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'cabin_1'],
      dtype='object')

Task for 2 min

In [80]:
titanic_train['Age'].min()
min = np.where(titanic_train['Age']==titanic_train['Age'].min())
titanic_train.iloc[min][['Name','Cabin']]

                             Name Cabin
78  Caldwell, Master. Alden Gates   NaN

# Concatination with two col and create a new

In [81]:
titanic_train['Family'] = titanic_train['SibSp'] + titanic_train['Parch']
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,n,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,n,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,n,0

In [82]:
most_family = np.where(titanic_train['Family'] == max(titanic_train['Family']))
most_family

(array([59, 71], dtype=int64),)

In [83]:
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,n,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,NaN,S,n,7

In [84]:
import numpy as np 
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]

In [85]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [86]:
# Own Name index 
pd.Series(my_data, index=['a','b','c'])#system remeber here 0,1,2

a    10
b    20
c    30
dtype: int64

In [88]:
se = pd.Series(my_data, index=['a','b','c'])#system remeber here 0,1,2
se[0]
se['a']

10

In [89]:
d = {'a':"kjhk", 'b':20, 'c':30}
d.items
pd.DataFrame(d, index=['s','k','m'])

      a   b   c
s  kjhk  20  30
k  kjhk  20  30
m  kjhk  20  30

In [90]:
d = {'a':"kjhk", 'b':20, 'c':30}
d.items
pd.DataFrame(d, index=['s','k','m',7,8,9])

      a   b   c
s  kjhk  20  30
k  kjhk  20  30
m  kjhk  20  30
7  kjhk  20  30
8  kjhk  20  30
9  kjhk  20  30

In [91]:
print('holding object from a dict ', '-'*40)
pd.Series([type, sum, max, min])

holding object from a dict  ----------------------------------------

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
3                    ([78],)
dtype: object

In [92]:
ser1 = pd.Series([1,2,3,4], index = [2,4,5,8])
ser2 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser2

CA    1
OR    2
NV    3
AZ    4
PT    5
dtype: int64

In [93]:
ser1

2    1
4    2
5    3
8    4
dtype: int64

In [95]:
ser1 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser2 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser1 + ser2

CA     2
OR     4
NV     6
AZ     8
PT    10
dtype: int64

In [97]:
ser1 = pd.Series([1,2,3,4,5],['CA', 'OR', 'NV', 'AZ', 'PT'])
ser2 = pd.Series([1,2,5,3,4],['CA', 'aOR', 'NV', 'aAZ', 'PT'])
ser1+ser2

AZ     NaN
CA     2.0
NV     8.0
OR     NaN
PT     9.0
aAZ    NaN
aOR    NaN
dtype: float64

In [98]:
ser1*ser2

AZ      NaN
CA      1.0
NV     15.0
OR      NaN
PT     20.0
aAZ     NaN
aOR     NaN
dtype: float64